; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	satellite2 - satellite
	instrument2 - instrument
	satellite3 - satellite
	instrument3 - instrument
	thermograph2 - mode
	thermograph0 - mode
	image4 - mode
	thermograph3 - mode
	image1 - mode
	Star5 - direction
	Star7 - direction
	Star8 - direction
	GroundStation9 - direction
	Star10 - direction
	Star12 - direction
	Star4 - direction
	Star11 - direction
	GroundStation1 - direction
	Star0 - direction
	GroundStation2 - direction
	GroundStation13 - direction
	Star6 - direction
	Star14 - direction
	GroundStation3 - direction
	Planet15 - direction
	Phenomenon16 - direction
	Star17 - direction
	Planet18 - direction
	Planet19 - direction
)
(:init
	(supports instrument0 thermograph2)
	(supports instrument0 thermograph0)
	(calibration_target instrument0 Star14)
	(calibration_target instrument0 Star4)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star7)
	(supports instrument1 thermograph3)
	(supports instrument1 thermograph0)
	(supports instrument1 thermograph2)
	(calibration_target instrument1 GroundStation2)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star10)
	(supports instrument2 thermograph3)
	(supports instrument2 thermograph0)
	(supports instrument2 image4)
	(calibration_target instrument2 Star0)
	(calibration_target instrument2 GroundStation1)
	(calibration_target instrument2 GroundStation3)
	(calibration_target instrument2 Star11)
	(on_board instrument2 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star10)
	(supports instrument3 image4)
	(supports instrument3 image1)
	(calibration_target instrument3 GroundStation3)
	(calibration_target instrument3 Star14)
	(calibration_target instrument3 Star6)
	(calibration_target instrument3 GroundStation13)
	(calibration_target instrument3 GroundStation2)
	(on_board instrument3 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Planet19)
)
(:goal (and
	(have_image Planet15 image1)
	(have_image Phenomenon16 thermograph3)
	(have_image Star17 thermograph0)
	(have_image Planet18 thermograph0)
	(have_image Planet19 thermograph0)
))

)

; plan
1. (turn_to satellite3 groundstation13 planet19)
   deleted: (pointing satellite3 planet19)
   added: (pointing satellite3 groundstation13)
   goals met: 0 of 5
2. (turn_to satellite1 groundstation2 star10)
   deleted: (pointing satellite1 star10)
   added: (pointing satellite1 groundstation2)
   goals met: 0 of 5
3. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 0 of 5
4. (calibrate satellite1 instrument1 groundstation2)
   added: (calibrated instrument1)
   goals met: 0 of 5
5. (turn_to satellite1 planet18 groundstation2)
   deleted: (pointing satellite1 groundstation2)
   added: (pointing satellite1 planet18)
   goals met: 0 of 5
6. (take_image satellite1 planet18 instrument1 thermograph0)
   added: (have_image planet18 thermograph0)
   goals met: 1 of 5
7. (turn_to satellite1 phenomenon16 planet18)
   deleted: (pointing satellite1 planet18)
   added: (pointing satellite1 phenomenon16)
   goals met: 1 of 5
8. (switch_on instrument3 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument3)
   goals met: 1 of 5
9. (calibrate satellite3 instrument3 groundstation13)
   added: (calibrated instrument3)
   goals met: 1 of 5
10. (take_image satellite1 phenomenon16 instrument1 thermograph3)
   added: (have_image phenomenon16 thermograph3)
   goals met: 2 of 5
11. (turn_to satellite1 planet19 phenomenon16)
   deleted: (pointing satellite1 phenomenon16)
   added: (pointing satellite1 planet19)
   goals met: 2 of 5
12. (take_image satellite1 planet19 instrument1 thermograph0)
   added: (have_image planet19 thermograph0)
   goals met: 3 of 5
13. (turn_to satellite1 star17 planet19)
   deleted: (pointing satellite1 planet19)
   added: (pointing satellite1 star17)
   goals met: 3 of 5
14. (take_image satellite1 star17 instrument1 thermograph0)
   added: (have_image star17 thermograph0)
   goals met: 4 of 5
15. (turn_to satellite3 planet15 groundstation13)
   deleted: (pointing satellite3 groundstation13)
   added: (pointing satellite3 planet15)
   goals met: 4 of 5
16. (take_image satellite3 planet15 instrument3 image1)
   added: (have_image planet15 image1)
   goals met: 5 of 5
